{"inkVersion":20,"root":[[{"#":"EventName: The Haunted Mansion"},"^You find yourself standing in front of a spooky old mansion. It's said that the place is haunted by the ghost of its former owner. What do you do?","\n","ev","str","^Enter the mansion","/str","/ev",{"*":"0.c-0","flg":20},"ev","str","^Walk away","/str","/ev",{"*":"0.c-1","flg":20},{"c-0":["\n",{"->":"Enter"},{"->":"0.g-0"},{"#f":5}],"c-1":["\n",{"->":"WalkAway"},{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"Enter":[["^You take a deep breath and step into the dark, creepy mansion. The floorboards creak beneath your feet as you make your way through the dusty, cobweb-covered rooms.","\n","^Suddenly, you hear a bloodcurdling scream coming from upstairs. What do you do?","\n","ev","str","^Investigate the scream","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Run away","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":"Investigate"},{"#f":5}],"c-1":["\n",{"->":"RunAway"},{"#f":5}]}],{"#f":1}],"Investigate":[["^You bravely make your way up the creaky staircase, heart racing as you try to keep quiet. As you reach the top, you see a ghostly figure standing in the hallway.","\n","^What do you do?","\n","ev","str","^Confront the ghost","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Hide and observe","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":"Confront"},{"#f":5}],"c-1":["\n",{"->":"Observe"},{"#f":5}]}],{"#f":1}],"Confront":[["^You boldly step forward and confront the ghostly figure. To your surprise, the ghost is actually the friendly ghost of the former owner, who has been haunting the mansion to protect its hidden treasure.","\n","^The ghost thanks you for your bravery, and gives you a key to the treasure room. What do you do?","\n","ev","str","^Open the treasure room","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Politely decline","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":"OpenRoom"},{"#f":5}],"c-1":["\n",{"->":"Decline"},{"#f":5}]}],{"#f":1}],"OpenRoom":["^You use the key to unlock the treasure room, and are amazed at the piles of gold and jewels inside. You feel like the luckiest person in the world!",{"#":"Happiness: +2"},"\n","done",{"#f":1}],"Decline":["^You thank the ghost for the offer, but politely decline. As you make your way back down the stairs and out of the mansion, you can't help but wonder what other adventures await you.","\n","done",{"#f":1}],"Observe":[["^You hide behind a nearby door and observe the ghost from a distance. To your surprise, the ghost disappears into thin air, leaving behind a key.","\n","^What do you do?","\n","ev","str","^Use the key to open the treasure room","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Leave the mansion","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ ",{"->":"OpenRoom"},"\n",{"#f":5}],"c-1":["^ ",{"->":"Leave"},"\n",{"#f":5}]}],{"#f":1}],"Leave":["^You decide you've had enough of the creepy old mansion and make your way back outside. As you walk away, you can't help but feel like you missed out on something.",{"#":"Happiness: -1"},"\n","done",{"#f":1}],"RunAway":[["^You turn and run as fast as you can out of the mansion, heart racing with fear. As you catch your breath outside, you realize that you left behind something important.","\n","^What do you do?","\n","ev","str","^Go back inside","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Leave it and walk away","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":"GoBack"},{"#f":5}],"c-1":["\n",{"->":"LeaveIt"},{"#f":5}]}],{"#f":1}],"GoBack":["^You steel your nerves and make your way back inside the mansion. As you search the rooms, you find a valuable piece of jewelry that you had dropped in your haste.","\n",{"#":"Money: +100"},{"#":"Happiness: +1"},"done",{"#f":1}],"LeaveIt":["^You decide to cut your losses and walk away from the mansion. As you walk down the street, you can't help but feel like you left something important behind.","\n",{"#":"Happiness: -1"},"done",{"#f":1}],"WalkAway":["^You decide that the spooky old mansion is just too creepy for you, and make your way back down the street. As you walk away, you can't help but wonder what would have happened if you had gone inside.","\n",{"#":"Happiness: +1"},"done","end",{"#f":1}],"#f":1}],"listDefs":{}}